// 充电站位置信息列表
// 在 src/views/MapPage.vue 中使用

export const stationPositionList = [
  {
    title: '东门北侧',
    addr: '桃园篮球场东侧车棚内',
    lat: 31.888485,
    lng: 118.829991,
  },
  {
    title: '东门南侧',
    addr: '东门校内南侧外卖架旁',
    lat: 31.886716,
    lng: 118.830103,
  },
  {
    title: '西门北侧',
    addr: '西门到快递站路口之间的道路北侧，南工路燕湖桥旁',
    lat: 31.886339,
    lng: 118.812658,
  },
  {
    title: '西门南侧',
    addr: '西门到快递站路口之间的道路南侧，南工路燕湖桥旁',
    lat: 31.886095,
    lng: 118.812658,
  },
  {
    title: '南门西侧',
    addr: '南门校外西侧',
    lat: 31.880837,
    lng: 118.819328,
  },
  {
    title: '南门东侧',
    addr: '南门校外东侧',
    lat: 31.880837,
    lng: 118.820108,
  },
  {
    title: '北门东北侧',
    addr: '北门校内东侧空地北侧，南高北路旁',
    lat: 31.893529,
    lng: 118.823852,
  },
  {
    title: '北门东南侧',
    addr: '北门校内东侧空地南侧，南高北路旁',
    lat: 31.893461,
    lng: 118.823852,
  },
  {
    title: '橘园北侧南',
    addr: '位于橘园9/10舍北侧道路的南侧',
    lat: 31.885002,
    lng: 118.812975,
  },
  {
    title: '校医院西',
    addr: '校医院西侧空地',
    lat: 31.892616,
    lng: 118.823786,
  },
  {
    title: '基二楼',
    addr: '丁家桥校区基二教学楼附近',
    lat: 32.07441,
    lng: 118.775305,
  },
  {
    title: '求恩一舍',
    addr: '丁家桥校区求恩一舍附近',
    lat: 32.07616,
    lng: 118.775664,
  },
  {
    title: '日新楼前',
    addr: '无锡国际校区体育馆东侧、日新楼南侧、网球场北侧',
    lat: 31.470371,
    lng: 120.260376,
  },
];
